twitter_clone/app/views/api/tweets/_tweet.json.jbuilder

SELECT COUNT(*) FROM "likes" WHERE "likes"."tweet_id" = $1  [["tweet_id", 1]]
SELECT  "likes".* FROM "likes" WHERE "likes"."tweet_id" = $1 AND "likes"."user_id" = $2 LIMIT $3  [["tweet_id", 1], ["user_id", 3], ["LIMIT", 1]]
---
json.extract! tweet, :id, :body, :author_id
json.likes tweet.likes.count
json.liked_by_current_user !!tweet.likes.find_by(user_id: current_user.id)