twitter_clone/app/controllers/api/tweets_controller.rb

INSERT INTO "tweets" ("body", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["body", "this is a new tweet"], ["author_id", 3], ["created_at", "2019-12-31 22:32:28.607329"], ["updated_at", "2019-12-31 22:32:28.607329"]]
---
  def create
    @tweet = Tweet.new(tweet_params)
    @tweet.author_id = current_user.id
    if @tweet.save