twitter_clone/app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "wjf0004"], ["LIMIT", 1]]
---
  def self.find_by_credentials(email, password)
    user = User.find(email: email)